INFORMATION System Continuity Assessment - #1 - 
SYS is becoming a critical part of ORG’ efforts. Making sure the data in this system is properly maintained may become a liability in the future, and good documentation and process can help that.
Assess current continuity plan documents*
Evaluate support mechanisms*
Evaluate existing data structure*
Evaluate current application technology stack*
Evaluate archival and backup/DR process/procedure*
Provide recommendations on how to strengthen the continuity plan*

INFORMATION System Continuity Documentation - #2 - 
As this is a critical piece of software for ORG, upgrading it can help improve security and stability.
Using Assessment information, update tecnical/process documentation*
Evaluate and update User documentation*
Generate User Stories that define the current product functionality*

INFORMATION System Continuity Product Roadmap - #3 - By Move
As this is a critical piece of software for ORG, upgrading it can help improve security and stability.
Evaluate existing product improvement process and roadmap
Recommend a new process/approach to product improvement/governance
Conduct Product Ideation sessions to generate Use Cases
Outline User Stories for projects
PROJECT: Data cleanup*

Access Shared Drive Remotely - #3 - By Move
As this is a critical piece of software for ORG, upgrading it can help improve security and stability.
Evaluate existing file management and organization structure
PROJECT: Migrate ORG to a server-based implementation of Office 365 One Drive
Update file management instructions/documentation for users

Upgrade Raiser's Edge and Sage MIP - #3 - By Move
As this is a critical piece of software for Pearls, upgrading it can help improve security and stability.
Evaluate upgrade pathway*
Plan out upgrade project*
Implement upgrade*
Update training materials and do a walkthrough

Review Current Technology Inventory/Documentation - #4, with Move
Having good technical documentation helps transfer IT knowledge both for technical vendors and internal staff. From technical diagrams to simple how-to instructions, having this information reduces the risks associated with transitioning tech support vendors and future troubleshooting. It also puts more control in the hands of the staff and leadership.
Conduct systems assessment*
Document critical systems and instructions*
System Maintenance Schedule*

Review Training Protocol and Curriculum - Also important - #5
Having a solid, simple documentation of the tools used everyday can help improve the transfer of knowledge and improve ongoing efficiency. It can also help make sure everyone on the team knows or has access to all the information they need to do their daily tasks.
Document Procedures and Processes for Technical Tools*
Update Training Protocols for Key Tools*
Update Training Materials*

Review Device Management Practices (Mobile, non-mobile) - #6
Having a simple but effective device management tool in place can help reduce potential data loss risks with mobile and laptop devices. Many options exist that are both effective and free to use.
Evaluate and plan device management needs
Implement device management system
Train office staff on device management protocols

Review Software Product Roadmap (Syslogic) - Dependent on Syslogic
Having a thoughtful software product roadmap is beneficial not only to plan for future investments, but to have a solid understanding of the requirements of your systems. (While much of this may be covered by the ORG grant, SCHOOL students may be able to help speed it along and allow Pearls to get more from the experience.) This also reduces risk from transferring knowledge and disasters.
Data Flow Map* (Document the way information is captured and who needs what)
Lean Analysis and Recommendations
File structure review*
Define File Naming and Folder Structure* (with expert assistance)
Change file naming structure (staff)
Implement software changes

Review How to Improve Communication with Girls and Families - Dependent on Syslogic
Improving communication between Pearls, teens and families is critical for maintaining efficiency while growing to Phase 2 and 3 goals. While the current methods are sufficient at present, looking into ways to improve those methods will aid future growth efforts.
Conduct a human-centered assessment of current communication methods*
Draft recommendations for changes in communication methods*
Implement changes*
Document methods and instructional guides*

Evaluate (Free) Hosted Email Options - #2 - By Move
Looking into free email solutions like Google Apps or Office365 could significantly benefit ORG long-term. Using these "cloud" hosted solutions help reduce/eliminate risks from hardware failure, disaster protection and security by being hosted by large trusted companies. As these solutions are free and require little to no technical expertise to administer, they also present significant cost savings.
Do a rapid needs discovery*
Review shared resource management (projectors, rooms, tablets)*
Develop a project plan*
Handle implementation/migration* (done with aid of experts)
Students conduct training*

Address Technical Challenges for Weekly Meetings - Most important - #1 - By Move
Having access to web-based resources consistently at the weekly Girls meetings would vastly improve efficiency, allowing program staff to research and display information, and to use existing software to track attendance. The biggest challenge here is understanding what options exist in MPS schools for access to the Internet. 36 sites
Conduct a Needs Assessment [Wireless (3G/4G) Site surveys]*
Add option to implement, document process

Technical Move Management - Talk about what it would take 
Moves can be both technical complicated and logistically challenging. Having an expert guide budget, design, planning and implementation can reduce headaches and reduce costs overall.
Evaluate needs
Design and budget for systems and vendors
Select systems/vendors
Implementation
Documentation 
